-- MySQL dump 10.13  Distrib 8.0.18, for Win64 (x86_64)
--
-- Host: localhost    Database: telecom
-- ------------------------------------------------------
-- Server version	8.0.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `model`
--

DROP TABLE IF EXISTS `model`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `model` (
  `model_id` int(11) NOT NULL AUTO_INCREMENT,
  `manufacturer` varchar(30) NOT NULL,
  `petname` varchar(30) NOT NULL,
  `modelname` varchar(30) NOT NULL,
  `network` varchar(10) NOT NULL,
  `storage` int(11) NOT NULL,
  `color` varchar(45) NOT NULL,
  `price` int(11) NOT NULL,
  `subsidy` int(11) DEFAULT NULL,
  PRIMARY KEY (`model_id`)
) ENGINE=InnoDB AUTO_INCREMENT=81 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `model`
--

LOCK TABLES `model` WRITE;
/*!40000 ALTER TABLE `model` DISABLE KEYS */;
INSERT INTO `model` VALUES (1,'애플','아이폰 11 Pro','A2215','4G',64,'실버',1390000,79300),(2,'삼성','갤럭시 폴드','SM-F907N','5G',512,'스페이스 실버',2398000,483000),(3,'삼성','갤럭시 폴드','SM-F907N','5G',512,'코스모스 블랙',2398000,483000),(4,'삼성','갤럭시 노트 10+','SM-N976N','5G',512,'아우라 글로우',1496000,368000),(5,'삼성','갤럭시 노트 10+','SM-N976N','5G',512,'아우라 블랙',1496000,368000),(6,'삼성','갤럭시 노트 10+','SM-N976N','5G',256,'아우라 글로우',1397000,368000),(7,'삼성','갤럭시 노트 10+','SM-N976N','5G',256,'아우라 블랙',1397000,368000),(8,'삼성','갤럭시 노트 10+','SM-N976N','5G',256,'아우라 블루',1397000,368000),(9,'삼성','갤럭시 노트 10+','SM-N976N','5G',256,'아우라 화이트',1397000,368000),(10,'삼성','갤럭시 노트 10','SM-N971N','5G',256,'아우라 핑크',1248500,368000),(11,'삼성','갤럭시 노트 10','SM-N971N','5G',256,'아우라 글로우',1248500,368000),(12,'삼성','갤럭시 노트 10','SM-N971N','5G',256,'아우라 블랙',1248500,368000),(13,'삼성','갤럭시 S10 5G','SM-G977N','5G',512,'마제스틱 블랙',1248500,483000),(14,'삼성','갤럭시 S10 5G','SM-G977N','5G',512,'크라운 실버',1248500,483000),(15,'삼성','갤럭시 S10 5G','SM-G977N','5G',256,'마제스틱 블랙',1281500,483000),(16,'삼성','갤럭시 S10 5G','SM-G977N','5G',256,'크라운 실버',1281500,483000),(17,'삼성','갤럭시 S10 5G','SM-G977N','5G',256,'로얄 골드',1281500,483000),(18,'삼성','갤럭시 S10+','SM-G975N','4G',512,'세라믹 블랙',1397000,155200),(19,'삼성','갤럭시 S10+','SM-G975N','4G',512,'세라믹 화이트',1397000,155200),(20,'삼성','갤럭시 S10+','SM-G975N','4G',128,'프리즘 블랙',1155000,155200),(21,'삼성','갤럭시 S10+','SM-G975N','4G',128,'프리즘 화이트',1155000,155200),(22,'삼성','갤럭시 S10+','SM-G975N','4G',128,'플라밍고 핑크',1155000,155200),(23,'삼성','갤럭시 S10','SM-G973N','4G',512,'프리즘 그린',998800,425500),(24,'삼성','갤럭시 S10','SM-G973N','4G',512,'프리즘 블랙',998800,425500),(25,'삼성','갤럭시 S10','SM-G973N','4G',512,'프리즘 화이트',998800,425500),(26,'삼성','갤럭시 S10','SM-G973N','4G',128,'프리즘 그린',899800,425500),(27,'삼성','갤럭시 S10','SM-G973N','4G',128,'프리즘 블랙',899800,425500),(28,'삼성','갤럭시 S10','SM-G973N','4G',128,'프리즘 화이트',899800,425500),(29,'삼성','갤럭시 S10','SM-G973N','4G',128,'플라밍고 핑크',899800,425500),(30,'삼성','갤럭시 S10e','SM-G970N','4G',128,'카나리아 옐로우',899800,460000),(31,'삼성','갤럭시 S10e','SM-G970N','4G',128,'프리즘 화이트',899800,460000),(32,'삼성','갤럭시 S10e','SM-G970N','4G',128,'프리즘 블랙',899800,460000),(33,'LG','V50S ThinQ','LM-V510N','5G',256,'오로라 블랙',1199000,368000),(34,'LG','V50 ThinQ','LM-V500N','5G',128,'아스트로 블랙',1199000,483000),(35,'LG','G8 ThinQ','LM-G820N','4G',128,'뉴 모로칸 블루',897600,690000),(36,'LG','G8 ThinQ','LM-G820N','4G',128,'카민 레드',897600,690000),(37,'LG','G8 ThinQ','LM-G820N','4G',128,'뉴 오로라 블랙',897600,690000),(38,'애플','아이폰 11 Pro Max','A2218','4G',512,'미드나잇 그린',1991000,79300),(39,'애플','아이폰 11 Pro Max','A2218','4G',512,'실버',1991000,79300),(40,'애플','아이폰 11 Pro Max','A2218','4G',512,'스페이스 그레이',1991000,79300),(41,'애플','아이폰 11 Pro Max','A2218','4G',512,'골드',1991000,79300),(42,'애플','아이폰 11 Pro Max','A2218','4G',256,'미드나잇 그린',1738000,79300),(43,'애플','아이폰 11 Pro Max','A2218','4G',256,'실버',1738000,79300),(44,'애플','아이폰 11 Pro Max','A2218','4G',256,'스페이스 그레이',1738000,79300),(45,'애플','아이폰 11 Pro Max','A2218','4G',256,'골드',1738000,79300),(46,'애플','아이폰 11 Pro Max','A2218','4G',64,'미드나잇 그린',1529000,79300),(47,'애플','아이폰 11 Pro Max','A2218','4G',64,'실버',1529000,79300),(48,'애플','아이폰 11 Pro Max','A2218','4G',64,'스페이스 그레이',1529000,79300),(49,'애플','아이폰 11 Pro Max','A2218','4G',64,'골드',1529000,79300),(50,'애플','아이폰 11 Pro','A2215','4G',512,'미드나잇 그린',1837000,79300),(51,'애플','아이폰 11 Pro','A2215','4G',512,'실버',1837000,79300),(52,'애플','아이폰 11 Pro','A2215','4G',512,'스페이스 그레이',1837000,79300),(53,'애플','아이폰 11 Pro','A2215','4G',512,'골드',1837000,79300),(54,'애플','아이폰 11 Pro','A2215','4G',256,'미드나잇 그린',1584000,79300),(55,'애플','아이폰 11 Pro','A2215','4G',256,'실버',1584000,79300),(56,'애플','아이폰 11 Pro','A2215','4G',256,'스페이스 그레이',1584000,79300),(57,'애플','아이폰 11 Pro','A2215','4G',256,'골드',1584000,79300),(58,'애플','아이폰 11 Pro','A2215','4G',64,'미드나잇 그린',1375000,79300),(59,'애플','아이폰 11 Pro','A2215','4G',64,'실버',1375000,79300),(60,'애플','아이폰 11 Pro','A2215','4G',64,'스페이스 그레이',1375000,79300),(61,'애플','아이폰 11 Pro','A2215','4G',64,'골드',1375000,79300),(62,'애플','아이폰 11','A2221','4G',256,'블랙',1188000,79300),(63,'애플','아이폰 11','A2221','4G',256,'화이트',1188000,79300),(64,'애플','아이폰 11','A2221','4G',256,'(PRODUCT)RED',1188000,79300),(65,'애플','아이폰 11','A2221','4G',256,'옐로',1188000,79300),(66,'애플','아이폰 11','A2221','4G',256,'퍼플',1188000,79300),(67,'애플','아이폰 11','A2221','4G',256,'그린',1188000,79300),(68,'애플','아이폰 11','A2221','4G',128,'블랙',1056000,79300),(69,'애플','아이폰 11','A2221','4G',128,'화이트',1056000,79300),(70,'애플','아이폰 11','A2221','4G',128,'(PRODUCT)RED',1056000,79300),(71,'애플','아이폰 11','A2221','4G',128,'옐로',1056000,79300),(72,'애플','아이폰 11','A2221','4G',128,'퍼플',1056000,79300),(73,'애플','아이폰 11','A2221','4G',128,'그린',1056000,79300),(74,'애플','아이폰 11','A2221','4G',64,'블랙',990000,79300),(75,'애플','아이폰 11','A2221','4G',64,'화이트',990000,79300),(76,'애플','아이폰 11','A2221','4G',64,'(PRODUCT)RED',990000,79300),(77,'애플','아이폰 11','A2221','4G',64,'옐로',990000,79300),(78,'애플','아이폰 11','A2221','4G',64,'퍼플',990000,79300),(79,'애플','아이폰 11','A2221','4G',64,'그린',990000,79300);
/*!40000 ALTER TABLE `model` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-12-02 12:20:16
